me = 366269351080361995

restart = False
token = ''
delete_all_channel = []
#==============================================================이 윗라인은 건들지 말것===================================================


# 허용 서버            잡다한                KPX                 DEV              KATO                 PEGA                      KOR
allowed_server = [534057556562280461, 726189358536851488, 698108955192197160, 753148675236036648, 747135420936093746, 744138944312115242]


#============================================명령어 창==================================================================================
command1 = '광물 시세를 보여줌\n\n광물과 수량을 입력하면 총값을 계산해줌\n쉼표로 구분'
command2 = '!광물시세 [광물이름]\n\n!광물계산기 [광물이름] [광물수량]\nex)!광물계산기 jaspet 32, veldspar 65'https://github.com/macqueen0987/KPX-Discord-Bot-Website/blob/main/bot/var.py
#=======================================================================================================================================


#======================================================대화방 연동 ID====================================================================
KOR_channel = 744157114024460319
PEGA_channel = 747135420936093749
KPX_channel = 744421664699449364
#                    KPX 대화방    PEGA 대화방      KOR            테섭
linked_channels1 = [KPX_channel, PEGA_channel,  KOR_channel, 698405971487359016]

#                    KPX KATO 대화방       KATO 대화방      PEGA KATO 대화방     KOR KATO 대화방         테섭
linked_channels2 = [758746081634025483,755355530368778311, 759393946651590676, 759400342622044210, 759392021194211358]
linked_color = {KPX_channel:'```css\n[KPX] [', PEGA_channel:'```ini\n[PEGA] [', KOR_channel:'```fix\n[KOR] [', 755355530368778311:'```[KATO] ['}
#=======================================================================================================================================


#======================================================디렉분들==========================================================================
ID_director =[    ]
XO = 
CEO = 
#========================================================================================================================================


#======================================================바이백 설정========================================================================
buyback_precentage = 1.8
#========================================================================================================================================


#======================================================장부 끝부분========================================================================
macqueen0987_end = 60
#========================================================================================================================================

#====================================================Ore, Mineral List===================================================================
ores={
    'ore' : ['Veldspar',
            'Scordite',
            'Pyroxeres',
            'Plagioclase',
            'Omber',
            'Kernite',
            'Jaspet',
            'Hemorphite',
            'Hedbergite',
            'Gneiss',
            'Dark Ochre',
            'Spodumain',
            'Crokite',
            'Bistot',
            'Arkonor',
            'Mercoxit'],

    'minerals': ['Tritanium',
                'Pyerite',
                'Mexallon',
                'Isogen',
                'Nocxium',
                'Megacyte',
                'Zydrine',
                'Morphite',
                'Heavy Water',
                'Helium Isotopes',
                'Hydrogen Isotopes',
                'Liquid Ozone',
                'Nitrogen Isotopes',
                'Oxygen Isotopes',
                'Strontium Clathrates'    ]
    
}
#==================================================================================================================================

welcome_message = 'KPX 코퍼레이션에 오신것을 환영합니다.\n디스코드 권한 요청 방법입니다.\n\n1. "[KPX] 아이디" 형식으로 KPX 디스코드 서버의 닉네임을 변경합니다. 이 때, \'아이디\'는 인게임 아이디와 동일해야 합니다.\n2. 콥 디스코드의 디스코드-권한요청 채널에 "KPX 콥 디스코드 권한 신청합니다" 라고 권한을 신청합니다.\n3. 이후 콥 임원들이 확인하시고 닉네임을 Green으로 변경시켜드리면 비공개 채널들을 보실 수 있습니다.\n4. KPX 디코 서버의 해당 채널들 중 [공지사항]은 반드시 숙독해 주십시오. \n5. KPX 디코 서버의 [환영합니다] 채널을 꼭! 정독하시기 바랍니다.\n\n※ 현재 인게임 내 콥 검색 시 "KPX"가 검색되지 않는 현상이 나타나고 있습니다. - 이러한 분들은 아래와 같은 두 가지 방법으로 가입신청을 하실 수 있습니다.\n1) 콥 검색 시 \'KPX\' 가 아닌 1000000218 숫자 입력 → 콥 조인 신청\n2) Contact 메뉴 → Sean Kay 아이디 등록 후 아이디 클릭 → 콥 조인 신청\n\n시간이 지나도 가입이 되지 않는다면 이 글을 참고하시어 어떤게 틀렸을까 살펴보시기 바랍니다. 즐거운 이브 되시길 바랍니다! 다시한번 KPX에 오신것을 진심으로 환영합니다!\nhttps://discord.gg/FyHxc9G'

search_kpx = '※ 현재 인게임 내 콥 검색 시 "KPX"가 검색되지 않는 현상이 나타나고 있습니다.\n- 이러한 분들은 아래와 같은 두 가지 방법으로 가입신청을 하실 수 있습니다.\n\n1) 콥 검색 시 \'KPX\' 가 아닌 1000000218 숫자 입력 → 콥 조인 신청\n2) Contact 메뉴 → Sean Kay 아이디 등록 후 아이디 클릭 → 콥 조인 신청'
